
        var znak = prompt('Який Ваш Знак ');
        var pora = prompt('Яка зараз пора року');
        var month = prompt('Який зараз місяць');

        var monthResult;
        var poraResult;
        var znakResult;
        var znakVybran;
        var chas;

        function deni() {
            var hour = new Date();
           return hour.getDay();

        }

        function ran(min,max) {

            return Math.floor(Math.random()*(max - min)) + min;

        }
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//                                        Data
                switch (deni()){
                    case 0:
                        chas = 'Неділю';
                        break;
                    case 1:
                        chas = 'Понеділок';
                        break;
                    case 2:
                        chas = 'Вівторок';
                        break;
                    case 3:
                        chas = 'Середу';
                        break;
                    case 4:
                        chas = 'Четвер';
                        break;
                    case 5:
                        chas = 'Пятницю';
                        break;
                    case 6:
                        chas = 'Суботу';
                        break;
                }

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//                               Який Знак Зодіаку

            if (znak === 'рак'||'лев'||'близнюки'||'близнюк') {
                switch (ran(1, 10)) {
                    case 1:
                        znakVybran = 'Потрібно Більше Спілкуватися З Друзями , Велика Ймовірність Походу В Магазин';
                        break;
                    case 2:
                        znakVybran = 'Потрібно Завжди Дивитися На Все З Оптимізмом , Сьогодні Ваші Зннаня З Математики ' +
                            'Стануть У Пригоді';
                        break;
                    case 3:
                        znakVybran = ' Потрібно Приділити Увагу Сімї ,І Вас Чекає Сьогодні Приємна Несподіванка';
                        break;
                    case 4:
                        znakVybran = ' Сьогодні тобі варто набратися сміливості і поговорити з керівником про те, що давно запланував';
                        break;
                    case 5:
                        znakVybran = ' Не варто реагувати на підступи недоброзичливців, зосередься на своїх цілях';
                        break;
                    case 6:
                        znakVybran = ' У другій половині дня спробуй змінити звичну поведінку, і ти побачиш, як легко люди дають те, що тобі потрібно.';
                        break;
                    case 7:
                        znakVybran = ' Розібравшись в документації, ти зможеш запобігти великим фінансовим розтратам';
                        break;
                    case 8:
                        znakVybran = ' Увечері варто повеселитися в галасливій компанії друзів, щоб отримати приємні емоції.';
                        break;
                    case 9:
                        znakVybran = ' У першій половині дня ти можеш спровокувати сварку в колективі.';
                        break;
                    case 10:
                        znakVybran = ' Потрібно відстоювати свої права мирним шляхом, щоб уникнути втрат. ';
                        break;
                }
                
        }
        
        
            if (znak==='козерог'||'водолій'||'риби') {
            switch (ran(1,10)) {
                case 1:
                    znakVybran = 'Не робіть незапланованих покупок. Контролюйте свої витрати. ';
                    break;
                case 2:
                    znakVybran = 'Ваші бажання важко втілити в реальність. Будьте терплячими';
                    break;
                case 3:
                    znakVybran = 'Не бійтесь просити про допомогу. Вас неодмінно підтримають друзі та близькі';
                    break;
                case 4:
                    znakVybran = 'У другій половині дня твої партнери можуть попросити звіт про виконану роботу';
                    break;
                case 5:
                    znakVybran = 'Не варто боятися афішувати реальну статистику, краще говорити правду';
                    break;
                case 6:
                    znakVybran = ' Увечері доведеться змінити свої плани через несподіваний візит родичів.';
                    break;
                case 7:
                    znakVybran = 'В цей день краще не треба намагатись до півищеної активності';
                    break;
                case 8:
                    znakVybran = 'Не варто себе докоряти за моменти ліні,замрійності, розсіяності і сонливості - це для вас сьогодні нормальне явище';
                    break;
                case 9:
                    znakVybran = 'Сьогодні тобі варто набратися сміливості і, ти зможеш запобігти великим фінансовим ';
                    break;
                case 10:
                    znakVybran = 'День духовних змін, пізнання, активний творчо і фізично';
                    break;
            }
            }

            if (znak==='діва'||'вага'||'скорпіон') {
            switch (ran(1,8)){
                case 1:
                    znakVybran = 'Вирушайте у відпочинок за місто. На вас чекає неймовірний вікенд.  ';
                    break;
                case 2:
                    znakVybran = 'Вдалий день для нових досягнень на роботі.  ';
                    break;
                case 3:
                    znakVybran = 'Попереду новий вдалий тиждень. Наберіться сил. ';
                    break;
                case 4:
                    znakVybran = 'Варто відвідати парну або сауну, можна розпочати цикл тривалого лікування; пити міцні напої небажано ';
                    break;
                case 5:
                    znakVybran = 'День вдалий для початку різних справ, медитації, голодування, посту та духовного прозріння ';
                    break;
                case 6:
                    znakVybran = 'Бажано їсти мясну їжу. Сни, як правило, будуть віщі.';
                    break;
                case 7:
                    znakVybran = 'Попереду новий вдалий тиждень. Наберіться сил. ';
                    break;
                case 8:
                    znakVybran = 'Цей день ефективний для обєднання сил з однодумцями заради поліпшення фінансового стану ';
                    break;
            }
            }
            if (znak==='овен'||'телець'||'стрілець'){
            switch (ran(1,9)){
                case 1:
                    znakVybran = 'Чудовий день для активного відпочинку. Займіться улюбленим видом спорту.  ';
                    break;
                case 2:
                    znakVybran = 'Ваш фінансовий стан стабілізується. Так тримати!  ';
                    break;
                case 3:
                    znakVybran = 'Стережіться обіцянок від оточуючих. Вас можуть підвести ';
                    break;
                case 4:
                    znakVybran = 'У першій половині дня ти можеш спровокувати сварку в колективі. ';
                    break;
                case 5:
                    znakVybran = 'Цей день буде результативним для побудови команди та колективної прац';
                    break;
                case 6:
                    znakVybran = 'Сьогодні твоя лінь і повільність можуть завдати чимало клопоту';
                    break;
                case 7:
                    znakVybran = 'У першій половині дня спробуй уникнути розбіжностей і суперечок  ';
                    break;
                case 8:
                    znakVybran = 'У першій половині дня старайся убезпечитися від участі у публічних заходах';
                    break;
                case 9:
                    znakVybran = 'У першій половині дня тобі варто подбати про зміцнення своєї репутаці';
                    break;
            }
            }
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


        switch (ran(1,10)) {
            case 1 :
                znakResult = 'Не Ображайте Рідних ';
                break;
            case 2 :
                znakResult = ' Приємна Звістка Від Друзів';
                break;
            case 3 :
                znakResult = ' пощастить З Грошима';
                break;
            case 4 :
                znakResult = ' пощастить З Навчанням';
                break;
            case 5 :
                znakResult = ' Початок дня варто присвятити роботі з документами';
                break;
            case 6 :
                znakResult = ' Сьогодні не найкращий день для реалізації творчих ідей';
                break;
            case 7:
                znakResult = ' У першій половині дня слід утриматися від підписання будь-яких документів';
                break;
            case 8 :
                znakResult = ' На початку дня стережися незаконних дій з боку конкурентів';
                break;
            case 9 :
                znakResult = ' Цей день ефективний для обєднання сил з однодумцями ';
                break;
            case 10 :
                znakResult = ' пощастить З Друзями';
                break;



        }


  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        //                              Який місяць

         if (month ==='липень'||'червень'||'серпень') {
            switch (ran(1,8)) {
                case 1:
                    monthResult = 'Доведеться приймати непрості рішення. ';
                    break;
                case 2:
                    monthResult = 'Час відпочити. Заплануйте романтичну подорож';
                    break;
                case 3:
                    monthResult = 'Нарешті ви маєте змогу купити те, про що давно мріяли. Зробіть вдалу покупку';
                    break;
                case 4:
                    monthResult = 'Бережіть своє здоровя. Уникайте стресів.';
                    break;
                case 5:
                    monthResult = 'На шляху до омріяного ви втратили чимало сил. Час у відпустку. ';
                    break;
                case 6:
                    monthResult = 'Ви успішно будуєте карєру. Так тримати! ';
                    break;
                case 7:
                    monthResult = 'На вас чекає приємний сюрприз в особистому житті';
                    break;
                case 8:
                    monthResult = 'Не перенапружуйтесь. Присвятіть час собі: почитайте книгу, подивіться улюблений серіал, сходіть на прогулянку. ';
                    break;
            }
         }
         if (month==='вересень'||'жовтень'||'листопад') {
            switch (ran(1, 8)){
                case 1:
                    monthResult = 'Тобі потрібно навести порядок. купить те, про що давно мріяли. ';
                    break;
                case 2:
                    monthResult = 'У першій половині дня слід бути уважним';
                    break;
                case 3:
                    monthResult = 'Сьогодні не найкращий день для покупок';
                    break;
                case 4:
                    monthResult = 'Сьогодні не найкращий день для прибирання';
                    break;
                case 5:
                    monthResult = 'У першій половині дня слід утриматися від їжі';
                    break;
                case 6:
                    monthResult = 'У першій половині дня слід утриматися від миття посуду ';
                    break;
                case 7:
                    monthResult = 'У першій половині дня слід утриматися від перегляду телевізора';
                    break;
                case 8:
                    monthResult = 'У першій половині дня слід утриматися від походу у магазин ';
                    break;
            }
         }
        if (month==='грудень'||'січень'||'лютий') {
            switch (ran(1,8)){
                case 1:
                    monthResult = 'На початку дня стережися незаконних дій з боку батьків ';
                    break;
                case 2:
                    monthResult = 'На початку дня стережися від холоду';
                    break;
                case 3:
                    monthResult = 'На початку дня стережися незаконних дій з боку діда мороза';
                    break;
                case 4:
                    monthResult = 'На початку дня стережися незаконних покупок';
                    break;
                case 5:
                    monthResult = 'На шляху до омріяного ви втратили чимало сил. Час у відпустку. ';
                    break;
                case 6:
                    monthResult = 'Цей день ефективний для обєднання з сімєю';
                    break;
                case 7:
                    monthResult = 'Цей день ефективний для обєднання сил для навчання';
                    break;
                case 8:
                    monthResult = 'Цей день ефективний для прибирання ';
                    break;
            }
        }
        if (month==='березень'||'квітень'||'травень') {
            switch (ran(1,8)){
                case 1:
                    monthResult = 'Доведеться приймати непрості рішення.У першій половині дня тобі варто подбати про зарядку ';
                    break;
                case 2:
                    monthResult = 'У другій половині дня старайся убезпечитися від участі походу в гості';
                    break;
                case 3:
                    monthResult = 'У першій половині дня спробуй уникнути розбіжностей з рідними';
                    break;
                case 4:
                    monthResult = 'У першій половині дня спробуй уникнути гостей';
                    break;
                case 5:
                    monthResult = 'Цей день буде результативним для відпочинку ';
                    break;
                case 6:
                    monthResult = 'Цей день буде результативним для прибирання';
                    break;
                case 7:
                    monthResult = 'Цей день буде результативним для готування страв';
                    break;
                case 8:
                    monthResult = 'У другій половині дня ти можеш собі прилягти поспати ';
                    break;
            }
        }
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//                                      Пора року


         if (pora==='зима'){
                switch (ran(1,6)){
                    case 1:
                        poraResult = 'Стосунки з колегами зміняться! Подобатися усім – нереально';
                        break;
                    case 2:
                        poraResult = 'Рідна людина потребує підтримки!   Ви маєте їй допомогти! ';
                        break;
                    case 3:
                        poraResult = 'Підвищать зарплатню!  Звісно, шеф вимагатиме більше віддачі! ';
                        break;
                    case 4:
                        poraResult = 'Завжди перевіряйте інформацію, не вірте  просто словам.';
                        break;
                    case 5:
                        poraResult = 'Звертайте увагу та прикмети і знаки долі. Вони справжні.';
                        break;
                    case 6:
                        poraResult = 'Обмежте спілкування. Навколо багато недоброзичливих. ';
                        break;
                }
    }
         if (pora==='весна'){
             switch (ran(1,6)){
                 case 1:
                     poraResult = 'До вас прислухаються і вас поважають. Тримайте марку.';
                     break;
                 case 2:
                     poraResult = 'Відмовтеся від поганої звички і отримаєте винагороду!';
                     break;
                 case 3:
                     poraResult = 'Ще краплина терпіння і те, що ви чекали, здійсниться. ';
                     break;
                 case 4:
                 poraResult = 'Часом ви буваєте нестерпними. Але у цьому ваш шарм. ';
                     break;
                 case 5:
                     poraResult = 'Ви сьогодні здатні справити враження. Покажіть себе! ';
                     break;
                 case 6:
                     poraResult = 'Вами керує здоровий азарт. У вас всі шанси бути першим!';
                     break;
             }
         }

         if (pora==='літо'){
             switch (ran(1,6)){
                 case 1:
                     poraResult = 'У вас з’явиться нова ціль у житті. Вона кардинально змінить вас!';
                     break;
                 case 2:
                     poraResult = 'Подорож до екзотичної країни змінить ваше ставлення до життя! ';
                     break;
                 case 3:
                     poraResult = 'Якщо не вдається якась справа, відпустіть її. ';
                     break;
                 case 4:
                     poraResult = 'Думайте лише про позитив і у житті  вам щаститиме!';
                     break;
                 case 5:
                     poraResult = 'Вас можуть втягнути у чужі інтриги. Тримайтесь осторонь.';
                     break;
                 case 6:
                     poraResult = 'День таємниць і загадок. Застосовуйте свою інтуїцію. ';
                     break;
             }
         }

         if (pora==='осінь'){
             switch (ran(1,6)){
                 case 1:
                     poraResult = 'Дізнаєтесь приголомшливу новину. Це змінить ваше життя.';
                     break;
                 case 2:
                     poraResult = 'Фортуна сьогодні на вашому боці! Не проґавте шанс! ';
                     break;
                 case 3:
                     poraResult = 'Позбавитись негативу допоможе басейн або пробіжка. ';
                     break;
                 case 4:
                     poraResult = 'Емоції зашкалюють. Краще прислухайтесь до порад рідних.';
                     break;
                 case 5:
                     poraResult = 'Ваш прекрасний настрій підштовхне до імпульсивних вчинків. ';
                     break;
                 case 6:
                     poraResult = 'Ваш прекрасний настрій підштовхне до імпульсивних вчинків. ';
                     break;

             }
         }









        alert('y'+" " +chas+" " + znak+'ам'+ " " + znakVybran + " " + znakResult + " " + monthResult + " " + poraResult);
